Attribute VB_Name = "modAboutCalendar2R"
'***************************************************************************************************
'   カレンダー関連関数(クラス呼び出し部分)                      modAboutCalendar2R(Module)
'
'   作成者:井上治  URL:http://www.ne.jp/asahi/excel/inoue/ [Excelでお仕事!]
'***************************************************************************************************
'   ※カレンダー関連関数の主要部分はクラス(clsAboutCalendar2R)側に実装されている
'***************************************************************************************************
'変更日付 Rev  変更履歴内容========================================================================>
'18/09/17(1.70)新規作成
'18/09/23(1.71)クラス初期化判定を行なわないプロシージャを追加(連続呼び出し用)
'19/12/22(1.74)Option Private Moduleを追加
'***************************************************************************************************
Option Explicit
Option Private Module
'===================================================================================================
' 祝日含むカレンダーテーブル用ユーザー定義(公開)
Public Type g_typAboutCalendar2
    Hiduke As Date                                  ' 日付
    Yobi As Long                                    ' 曜日(0=日､1=月､2=火～6=土)
    Syusu As Long                                   ' 週数(1始まりで日曜日発見時に1加算)
    HmSyusu As Long                                 ' 週数(0始まりで月曜日発見時に1加算) ※祝日法(HM)対応
    Syuku As Long                                   ' 祝日判定(0=通常､1=祝日､2=振替休日､3=会社休日)
    SyukuNm As String                               ' 祝日名称
    FurikaeKbn As Long                              ' 振替区分(0=通常､1=振替休日を行なわない)
End Type
'===================================================================================================
' カレンダー関連関数クラス
Public g_clsAboutCalendar As clsAboutCalendar2R     ' カレンダー関連関数クラス
Private g_blnInitAboutCalendar As Boolean           ' カレンダー関連関数クラス初期化判定
' [注]VBAではモジュール保持変数の｢保持｣は保証されない

'***************************************************************************************************
'   ■■■ 公開プロシージャ(Public) ■■■
'***************************************************************************************************
'* 処理名　：GP_InitAboutCalendar
'* 機能　　：カレンダー関連関数クラス初期化
'===================================================================================================
'* 返り値　：(なし)
'* 引数　　：(なし)
'===================================================================================================
'* 作成日　：2018年09月17日
'* 作成者　：井上　治
'* 更新日　：2018年09月23日
'* 更新者　：井上　治
'* 機能説明：
'* 注意事項：初期化済みの場合はスキップされる
'***************************************************************************************************
Public Sub GP_InitAboutCalendar()
    '==============================================================================================-
    ' 未初期化なら初期化を行なう
    If Not g_blnInitAboutCalendar Then
        ' カレンダー関連関数クラスを初期化(クラス側で祝日パラメータテーブルが作成される)
        Set g_clsAboutCalendar = New clsAboutCalendar2R
        g_blnInitAboutCalendar = True
    End If
End Sub

'***************************************************************************************************
'* 処理名　：GP_GetCalendarTable1
'* 機能　　：カレンダーテーブル作成(当月1ヶ月用)
'===================================================================================================
'* 返り値　：(なし)
'* 引数　　：Arg1 = 年(Long)
'* 　　　　　Arg2 = 月(Long)
'* 　　　　　Arg3 = カレンダーテーブル(Array:Structure)         ※Ref参照
'===================================================================================================
'* 作成日　：2018年09月17日
'* 作成者　：井上　治
'* 更新日　：2018年09月17日
'* 更新者　：井上　治
'* 機能説明：
'* 注意事項：
'***************************************************************************************************
Public Sub GP_GetCalendarTable1(ByVal lngY As Long, _
                                ByVal lngM As Long, _
                                ByRef tblCalendar() As g_typAboutCalendar2)
    '==============================================================================================-
    ' カレンダー関連関数クラス初期化
    Call GP_InitAboutCalendar
    ' カレンダーテーブル作成(当月分)
    Call g_clsAboutCalendar.GetCalendarTable1(lngY, lngM, tblCalendar)
End Sub

'***************************************************************************************************
'* 処理名　：GP_GetCalendarTable1R
'* 機能　　：カレンダーテーブル作成(当月1ヶ月用)
'===================================================================================================
'* 返り値　：(なし)
'* 引数　　：Arg1 = 年(Long)
'* 　　　　　Arg2 = 月(Long)
'* 　　　　　Arg3 = カレンダーテーブル(Array:Structure)         ※Ref参照
'===================================================================================================
'* 作成日　：2018年09月23日
'* 作成者　：井上　治
'* 更新日　：2018年09月23日
'* 更新者　：井上　治
'* 機能説明：
'* 注意事項：カレンダー関連関数クラスが初期化済であること(本処理内では判定しない)
'***************************************************************************************************
Public Sub GP_GetCalendarTable1R(ByVal lngY As Long, _
                                 ByVal lngM As Long, _
                                 ByRef tblCalendar() As g_typAboutCalendar2)
    '==============================================================================================-
    ' カレンダーテーブル作成(当月分)
    Call g_clsAboutCalendar.GetCalendarTable1(lngY, lngM, tblCalendar)
End Sub

'***************************************************************************************************
'* 処理名　：GP_GetCalendarTable3
'* 機能　　：カレンダーテーブル作成(当月+前後の3ヶ月用)
'===================================================================================================
'* 返り値　：(なし)
'* 引数　　：Arg1 = 年(Long)
'* 　　　　　Arg2 = 月(Long)
'* 　　　　　Arg3 = カレンダーテーブル(Array:Structure)         ※Ref参照
'* 　　　　　Arg4 = カレンダーテーブル当月開始INDEX(Long)       ※Ref参照(Option)
'* 　　　　　Arg5 = カレンダーテーブル当月終了INDEX(Long)       ※Ref参照(Option)
'===================================================================================================
'* 作成日　：2018年09月17日
'* 作成者　：井上　治
'* 更新日　：2018年09月17日
'* 更新者　：井上　治
'* 機能説明：
'* 注意事項：
'***************************************************************************************************
Public Sub GP_GetCalendarTable3(ByVal lngYear As Long, _
                                ByVal lngMonth As Long, _
                                ByRef tblCalendar() As g_typAboutCalendar2, _
                                Optional ByRef lngCurrStartIx As Long = -1, _
                                Optional ByRef lngCurrEndIx As Long = -1)
    '==============================================================================================-
    ' カレンダー関連関数クラス初期化
    Call GP_InitAboutCalendar
    ' カレンダーテーブル作成(当月+前後の3ヶ月用)
    Call g_clsAboutCalendar.GetCalendarTable3(lngYear, _
                                              lngMonth, _
                                              tblCalendar, _
                                              lngCurrStartIx, _
                                              lngCurrEndIx)
End Sub

'***************************************************************************************************
'* 処理名　：GP_GetCalendarTable3R
'* 機能　　：カレンダーテーブル作成(当月+前後の3ヶ月用)
'===================================================================================================
'* 返り値　：(なし)
'* 引数　　：Arg1 = 年(Long)
'* 　　　　　Arg2 = 月(Long)
'* 　　　　　Arg3 = カレンダーテーブル(Array:Structure)         ※Ref参照
'* 　　　　　Arg4 = カレンダーテーブル当月開始INDEX(Long)       ※Ref参照(Option)
'* 　　　　　Arg5 = カレンダーテーブル当月終了INDEX(Long)       ※Ref参照(Option)
'===================================================================================================
'* 作成日　：2018年09月23日
'* 作成者　：井上　治
'* 更新日　：2018年09月23日
'* 更新者　：井上　治
'* 機能説明：
'* 注意事項：カレンダー関連関数クラスが初期化済であること(本処理内では判定しない)
'***************************************************************************************************
Public Sub GP_GetCalendarTable3R(ByVal lngYear As Long, _
                                 ByVal lngMonth As Long, _
                                 ByRef tblCalendar() As g_typAboutCalendar2, _
                                 Optional ByRef lngCurrStartIx As Long = -1, _
                                 Optional ByRef lngCurrEndIx As Long = -1)
    '==============================================================================================-
    ' カレンダーテーブル作成(当月+前後の3ヶ月用)
    Call g_clsAboutCalendar.GetCalendarTable3(lngYear, _
                                              lngMonth, _
                                              tblCalendar, _
                                              lngCurrStartIx, _
                                              lngCurrEndIx)
End Sub

'***************************************************************************************************
'* 処理名　：GP_SumEigyoNissu
'* 機能　　：営業日数算出(土日祝日を除外)
'===================================================================================================
'* 返り値　：(なし)
'* 引数　　：Arg1 = 期間開始日(Date)
'* 　　　　　Arg2 = 期間終了日(Date)
'* 　　　　　Arg3 = 営業日数(Long)                              ※Ref参照
'* 　　　　　Arg4 = 歴日数(Long)                                ※Ref参照(Option)
'* 　　　　　Arg5 = チェック工程スキップ(Boolean)               ※Option
'===================================================================================================
'* 作成日　：2018年09月17日
'* 作成者　：井上　治
'* 更新日　：2018年09月17日
'* 更新者　：井上　治
'* 機能説明：
'* 注意事項：開始日､終了日自体も営業日判断に適用される
'***************************************************************************************************
Public Sub GP_SumEigyoNissu(ByVal dteDateF As Date, _
                            ByVal dteDateT As Date, _
                            ByRef lngCntEigyo As Long, _
                            Optional ByRef lngCntReki As Long = 0)
    '==============================================================================================-
    ' カレンダー関連関数クラス初期化
    Call GP_InitAboutCalendar
    ' 営業日数算出(土日祝日を除外)
    Call g_clsAboutCalendar.SumEigyoNissu(dteDateF, dteDateT, lngCntEigyo, lngCntReki)
End Sub

'***************************************************************************************************
'* 処理名　：GP_SumEigyoBi
'* 機能　　：営業日数経過後営業日算出(土日祝日を除外)
'===================================================================================================
'* 返り値　：(なし)
'* 引数　　：Arg1 = 起算日(Date)
'* 　　　　　Arg2 = 経過日数(Long)                              ※±可能
'* 　　　　　Arg3 = 営業日数経過後営業日(Date)                  ※Ref参照(Option)
'===================================================================================================
'* 作成日　：2018年09月17日
'* 作成者　：井上　治
'* 更新日　：2018年09月17日
'* 更新者　：井上　治
'* 機能説明：経過日数は翌日(翌営業日)を｢1｣として算出される(前営業日は｢-1｣)
'* 注意事項：経過日数がゼロの場合は起算日をそのまま返す(土日祝判断なし)
'***************************************************************************************************
Public Sub GP_SumEigyoBi(ByVal dteDateF As Date, _
                         ByVal lngCntKeika As Long, _
                         ByRef dteDateT As Date)
    '==============================================================================================-
    ' カレンダー関連関数クラス初期化
    Call GP_InitAboutCalendar
    ' 営業日数経過後営業日算出(土日祝日を除外)
    Call g_clsAboutCalendar.SumEigyoBi(dteDateF, lngCntKeika, dteDateT)
End Sub

'========================================<< End of Source >>========================================

